import { type WhyUs } from "~/types/whyUs";
export const whyUs: WhyUs[] = [
  {
    id: 1,
    content:
      "ما یک طراحی سفارشی و منحصر به فرد برای سایت فروشگاهی شما ارائه خواهیم داد. طراحی با توجه به نوع محصولات و نیازهای  شما خواهد بود و برند شما در بین رقبایتان متمایز تر میکنیم و همچنین ما به طور ویژه بر رابط کاربری استفاده‌پذیر و دوست‌داشتنی تمرکز می‌کنیم. مشتریانتان به راحتی می‌توانند محصولات را جستجو کنند، سبد خرید خود را مدیریت کنند و به راحتی فرآیند خرید را انجام دهند.",
    img:'1.png',
  },
  {
    id: 2,
    content: ` سیستم مدیریت محتوا قدرتمندی را برای شما فراهم می‌کنیم تا بتوانید به راحتی محصولات جدید را اضافه کرده، قیمت‌ها و محتوای سایت خود را به روز نگه دارید.
    شما می‌توانید درگاه‌های پرداخت آنلاین را به سایت خود اضافه کنید تا مشتریان بتوانند به راحتی و با اطمینان خرید خود را انجام دهند.سایت فروشگاهی شما بهینه‌سازی می‌شود تا در نتایج جستجوی گوگل و سایر موتورهای جستجو به خوبی قابل رویت باشد تا از رقبا پیشی بگیرید.`,
    img:"2.png",
  },
  {
    id: 3,
    content:
      "شما می‌توانید یک نمایشگاه آنلاین برای محصولات خود ایجاد کنید، مشتریانتان را به دیدن و خرید محصولات جدید ترغیب کنید و تجربه خرید و دیدن واقعیت مجازی را برای آن‌ها فراهم کنید.سایت فروشگاهی شما برای تمام دستگاه‌ها و رزولوشن‌ها بهینه شده است، بنابراین مشتریان می‌توانند از هر کجا و هر زمانی به سادگی به فروشگاه شما دسترسی داشته باشند.",
    img:"3.png",
  },
  {
    id: 4,
    content:
      "ما به شما امکان می‌دهیم تا به راحتی با مشتریان خود در ارتباط باشید و سوالات و مشکلات آن‌ها را برطرف کنید. سیستم پشتیبانی آنلاین و ارتباط فعال با مشتریان، رضایت آن‌ها را افزایش می‌دهد.سیستم تحلیل داده‌ها و آمار وب سایت به شما امکان می‌دهد تا بازدیدها، فروش، رفتار مشتریان و الگوهای خرید آن‌ها را تحلیل کنید و استراتژی‌های بهبود را اجرا کنید.",
    img:"4.png",
  },
];
