<template>
  <div class="bg-black mt-20">
    <div class="py-10 px-16 text-center">
      <h1 class="text-2xl">تعرفه های طراحی سایت</h1>
      <p class="mt-10 text-lg leading-6">
        “آیا شما می‌خواهید حضور قوی‌تری در دنیای آنلاین داشته باشید؟ آیا می‌خواهید کسب و کارتان را
        به سطح جدیدی از موفقیت برسانید؟ اگر پاسخ شما بله است، طراحی یک وبسایت حرفه‌ای برای شما ضروری
        است. ما با تعهد کامل با خلق تجربه‌ ای بی‌نظیر برای مشتریان خود، به عنوان یک تیم حرفه‌ای در
        طراحی وبسایت فعالیت می‌کنیم. با ترکیب زیبایی و کارایی در طراحی، به شما یک وبسایت منحصر به
        فرد و جذاب ارائه می‌دهیم که همه جوانب کسب و کار شما را با دقت و جزئیات بیان می‌کند. با
        انتخاب خدمات ما، می‌توانید با خیال راحت به توسعه کسب و کار خود بپردازید و به مشتریان جدیدی
        دست پیدا کنید. تکنولوژی روز و طراحی خلاقانه ما، همراه با توجه ویژه به نیازهای شما، تضمین
        می‌کند که وبسایتی بی‌نظیر و قدرتمند برای شما ایجاد کنیم. پس منتظر چه چیزی هستید، از طراحی
        سایت خود نصبت به رقبا عقب نمانید! با ما تماس بگیرید و تجربه‌ای بی‌نظیر در دنیای آنلاین را
        تجربه کنید!” در مورد قیمت، باید بدانید که هزینه طراحی سایت بستگی به عوامل متعددی دارد، از
        جمله اندازه و پیچیدگی سایت، قابلیت‌ها و افزونه‌های مورد نیاز، سطح طراحی و توسعه، و موارد
        دیگر. برای اطلاعات دقیق‌تر درباره قیمت، بهتر است با ما تماس بگیرید و نیازهای خود را مطرح
        کنید تا بتوانیم با یک برآورد قیمت شما را بهتر راهنمایی کنیم.
      </p>
      <div class="mt-7">
        <BaseButton text="لیست قیمت سایت شرکتی" class="mx-3" />
        <BaseButton text="لیست قیمت سایت فروشگاهی" class="mx-3" />
      </div>
    </div>
    <div class="text-center px-16">
      <h3 class="text-xl text-light-primary">تعرفه های طراحی سایت شرکتی</h3>
      <p class="text-lg mt-3">
        با سپاس از شما که به عنوان یک همکار در حوزه دیجیتال ما را انتخاب کردید تا افتخار همکاری با
        شما را داشته باشیم،
      </p>
      <h2 class="text-lg mt-4">طراحی یک سایت شرکتی حرفه‌ای</h2>
      <p class="text-lg mt-3">
        ما به شما کمک خواهیم کرد تا یک حضور قوی در دنیای آنلاین داشته باشید تا بتوانید خدمات و
        محصولات خود را به بهترین وجه نمایش دهید.
      </p>
      <h2 class="text-xl mt-4 text-light-primary">
        برآورد قیمت طراحی سایت شرکتی شما بستگی به عوامل مختلفی دارد که شامل موارد زیر می‌شود:
      </h2>
      <p class="text-lg leading-6 mt-3">
        اندازه سایت: آیا شما به یک سایت ساده و یک صفحه‌ای نیاز دارید یا یک سایت چند صفحه‌ای با
        بخش‌های مختلف؟ طراحی سفارشی: آیا شما نیاز دارید تا طراحی سفارشی و یکتایی برای سایت شرکتی خود
        داشته باشید؟ قابلیت‌ها و ویژگی‌ها: آیا شما نیاز دارید تا قابلیت‌های خاصی مانند فرم تماس،
        نمونه کارها، بلاگ، نشانی واقعی و نقشه، فروشگاه آنلاین و غیره به سایت خود اضافه کنید؟
        پیاده‌سازی سیستم مدیریت محتوا: آیا شما قصد دارید تا بتوانید به راحتی محتوای سایت خود را
        بروزرسانی کنید؟ راست‌چین یا چپ‌چین: آیا شما نیاز دارید تا سایت شرکتی شما به زبان‌های
        راست‌چین مانند عربی یا فارسی طراحی شود یاچپ چین مثل زبان انگلیسی؟ بهینه‌سازی برای موتورهای
        جستجو: آیا شما می‌خواهید سایت شرکتی شما در نتایج جستجوی گوگل و سایر موتورهای جستجو به خوبی
        قابل رویت باشد؟ برای ارائه یک برآورد دقیق و بهترین قیمت برای طراحی سایت شرکتی شما، لطفاً با
        ما تماس بگیرید و جزئیات پروژه خود را با ما در میان بگذارید. تا تیم ما از تجربه و تخصص خود
        برای ارائه یک پیشنهاد مناسب به شما استفاده کند. با توجه به اینکه هر پروژه ممکن است نیازهای
        خاص خود را داشته باشد، قیمت نهایی ممکن است متغیر باشد. ما به دقت به نیازها و بودجه شما توجه
        می‌کنیم اما در نهایت لیست اولیه قیمت طراحی سایت شرکتی برای شما آماده کرده ایم که میتوانید
        مشاهده کنید.
      </p>
    </div>
    <div class="flex">
      <BaseCard
        v-for="packages in allPackages"
        :key="packages.name"
        :packageItems="packages.items"
        :name="packages.name"
        :price="packages.price"
        :mode="packages.mode"
      />
    </div>
  </div>
</template>

<script setup>
import { companySitePackages } from "@/content/companySitePackages";
const allPackages = ref([
  {
    name: "برنزی",
    mode:"bronze",
    items: companySitePackages,
    price: "۱۱،۰۰۰،۰۰۰",
  },
  {
    name: "تفره ای",
    mode:"silver",
    items: companySitePackages,
    price: "۱۳،۰۰۰،۰۰۰",
  },
  {
    name: "طلایی",
    mode:"gold",
    items: companySitePackages,
    price: "۱۵،۰۰۰،۰۰۰",
  },
  {
    name: "VIP",
    mode:"vip",
    items: companySitePackages,
    price: "۱۸،۰۰۰،۰۰۰",
  },
]);
</script>

<style></style>
