<template>
  <div class="bg-[#110A14] mt-20 rtl">
    <div class="py-10 md:px-20 text-center px-2 ">
      <h1 class="md:text-2xl text-lg text-light-primary text-center">
        <span>سئو هزینه نیست</span> <span class="md:mr-10 ">یک سرمایه گذاری مطمئن است </span>
      </h1>
      <p class="mt-10 leading-7 md:px-20">
        آیا می‌خواهید کسب و کار آنلاین خود را به سطح بعدی ببرید؟<br />
        آیا تمایل دارید تا در جستجوهای گوگل برتری داشته باشید و مشتریان پتانسیل خود را جذب کنید؟<br />
        اگر پاسخ شما بله است، به شما پیشنهاد می‌کنیم سئو را جدی بگیرید و آن را به عنوان یک ابزار
        استراتژیک برای رشد و موفقیت خود در نظر بگیرید.<br />
        سئو نه تنها یک مجموعه از تکنیک‌ها و روش‌هاست، بلکه یک فرهنگ و روحیه است که به سایت شما زندگی
        می‌بخشد. با بهینه‌سازی وبسایت خود، شما قدرتی عظیم در دست خواهید داشت تا به جمعیت بزرگی از
        مشتریان با پتانسیل دسترسی پیدا کنید و از رقبای خود پیشی بگیرید.<br />
        امروزه، رقابت در دنیای آنلاین بیش از هر زمان دیگری افزایش یافته است. میلیون‌ها وبسایت و کسب
        و کار آنلاین در حال رقابت برای جذب توجه کاربران هستند. اما سئو می‌تواند شما را از این رقابت
        بیرون بکشد و به شما امکان دهد تا در قلب مخاطبان خود جایگاهی ویژه برای خود ایجاد کنید.
      </p>
      <p class="text-base mt-7 leading-7">
        اگر به اطلاعات بیشتری در مورد خدمات سئو و چگونگی تاثیر آن در رشد کسب و کارتان نیاز دارید،<br />فرم
        زیر را پر کنید تا همکاران متخصص ما با شما تماس بگیرند و از مشاوره رایگان ما استفاده کنید.
      </p>
    </div>
    <h3 class="md:text-xl text-sub text-center text-light-primary">فرم مشاوره سئو سایت</h3>
    <TheSeoForm />
  </div>
</template>

<script setup></script>

<style></style>
